balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1459.PIC
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="nn----n-" edc:cname="ICDSTAT" edc:desc="" edc:impl="0xc2" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xx----x-" edc:name="ICDSTAT" edc:nzwidth="8" edc:por="xx----x-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="USRHLTF" edc:desc="" edc:mask="0x1" edc:name="USRHLTF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRP0HLTF" edc:desc="" edc:mask="0x1" edc:name="TRP0HLTF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRP1HLTF" edc:desc="" edc:mask="0x1" edc:name="TRP1HLTF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DEVSEL" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----xxx" edc:name="DEVSEL" edc:nzwidth="8" edc:por="-----xxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DEVSEL0" edc:desc="" edc:mask="0x1" edc:name="DEVSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DEVSEL1" edc:desc="" edc:mask="0x1" edc:name="DEVSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DEVSEL2" edc:desc="" edc:mask="0x1" edc:name="DEVSEL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ICDINSTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ICDINSTL" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBGIN0" edc:desc="" edc:mask="0x1" edc:name="DBGIN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN1" edc:desc="" edc:mask="0x1" edc:name="DBGIN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN2" edc:desc="" edc:mask="0x1" edc:name="DBGIN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN3" edc:desc="" edc:mask="0x1" edc:name="DBGIN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN4" edc:desc="" edc:mask="0x1" edc:name="DBGIN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN5" edc:desc="" edc:mask="0x1" edc:name="DBGIN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN6" edc:desc="" edc:mask="0x1" edc:name="DBGIN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN7" edc:desc="" edc:mask="0x1" edc:name="DBGIN7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ICDINSTH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxx" edc:name="ICDINSTH" edc:nzwidth="8" edc:por="--xxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBGIN8" edc:desc="" edc:mask="0x1" edc:name="DBGIN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN9" edc:desc="" edc:mask="0x1" edc:name="DBGIN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN10" edc:desc="" edc:mask="0x1" edc:name="DBGIN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN11" edc:desc="" edc:mask="0x1" edc:name="DBGIN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN12" edc:desc="" edc:mask="0x1" edc:name="DBGIN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN13" edc:desc="" edc:mask="0x1" edc:name="DBGIN13" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="n------n" edc:cname="ICDBK0CON" edc:desc="" edc:impl="0x81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="x------x" edc:name="ICDBK0CON" edc:nzwidth="8" edc:por="x------x">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BKHLT" edc:desc="" edc:mask="0x1" edc:name="BKHLT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="BKEN" edc:desc="" edc:mask="0x1" edc:name="BKEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ICDBK0L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ICDBK0L" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BKA0" edc:desc="" edc:mask="0x1" edc:name="BKA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA1" edc:desc="" edc:mask="0x1" edc:name="BKA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA2" edc:desc="" edc:mask="0x1" edc:name="BKA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA3" edc:desc="" edc:mask="0x1" edc:name="BKA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA4" edc:desc="" edc:mask="0x1" edc:name="BKA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA5" edc:desc="" edc:mask="0x1" edc:name="BKA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA6" edc:desc="" edc:mask="0x1" edc:name="BKA6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA7" edc:desc="" edc:mask="0x1" edc:name="BKA7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
